<script>
import WayPaymentComponent from "@/components/WayPaymentComponent.vue";

export default {
    name: "TopupView",
    components: {WayPaymentComponent},
    data () {
        return {
            payments: [
                {
                    svg: "<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"18\" viewBox=\"0 0 26 20\" fill=\"none\"><path d=\"M21.7692 1H4.23077C2.44646 1 1 2.4103 1 4.15V15.85C1 17.5897 2.44646 19 4.23077 19H21.7692C23.5535 19 25 17.5897 25 15.85V4.15C25 2.4103 23.5535 1 21.7692 1Z\" stroke=\"white\" stroke-width=\"1.5\" stroke-linecap=\"round\" stroke-linejoin=\"round\"/><path d=\"M1 7H25M5.61538 12.5371H8.38462V13.5625H5.61538V12.5371Z\" stroke=\"white\" stroke-width=\"1.5\" stroke-linejoin=\"round\"/></svg>",
                    title: "Банковская карта",
                    description: "Купить криптовалюту по карте",
                    link: "topupcard",
                    background: "#8774E1",
                },
                {
                    svg: "<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"24\" height=\"24\" viewBox=\"0 0 26 26\" fill=\"none\"><path d=\"M22 19L25 22L22 25\" stroke=\"white\" stroke-width=\"1.5\" stroke-linecap=\"round\" stroke-linejoin=\"round\"/><path d=\"M3.5 6C4.16304 6 4.79893 5.73661 5.26777 5.26777C5.73661 4.79893 6 4.16304 6 3.5C6 2.83696 5.73661 2.20107 5.26777 1.73223C4.79893 1.26339 4.16304 1 3.5 1C2.83696 1 2.20107 1.26339 1.73223 1.73223C1.26339 2.20107 1 2.83696 1 3.5C1 4.16304 1.26339 4.79893 1.73223 5.26777C2.20107 5.73661 2.83696 6 3.5 6Z\" stroke=\"white\" stroke-width=\"1.5\" stroke-linejoin=\"round\"/><path d=\"M6 3H10.75C11.3799 3 11.984 3.25829 12.4294 3.71806C12.8748 4.17783 13.125 4.8014 13.125 5.45161V19.5484C13.125 20.1986 13.3752 20.8222 13.8206 21.2819C14.266 21.7417 14.8701 22 15.5 22H25\" stroke=\"white\" stroke-width=\"1.5\" stroke-linecap=\"round\" stroke-linejoin=\"round\"/></svg>",
                    title: "P2P Экспресс",
                    description: "Сделка с надежными продавцами",
                    link: "topupcard",
                    background: "#8774E1",
                },
                {
                    svg: '<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 26 26" fill="none"><path d="M2.09091 11.9091H7.54545M7.54545 11.9091V8.63636M7.54545 11.9091H13M13 11.9091V8.63636M13 11.9091H18.4545M18.4545 11.9091V8.63636M18.4545 11.9091H23.9091M9.72727 16.2727H11.9091M14.0909 16.2727H16.2727M14.0909 19.5455H16.2727M9.72727 19.5455H11.9091M22.8182 24V12.9091C22.8182 12.3568 23.2659 11.9091 23.8182 11.9091H24C24.5523 11.9091 25 11.4614 25 10.9091V7.78152C25 7.62628 24.9639 7.47316 24.8944 7.33431L22.0037 1.55279C21.8343 1.214 21.488 1 21.1092 1H4.89076C4.51199 1 4.16573 1.214 3.99633 1.55279L1.10557 7.33431C1.03615 7.47316 1 7.62628 1 7.78152V10.9091C1 11.4614 1.44771 11.9091 2 11.9091H2.18182C2.7341 11.9091 3.18182 12.3568 3.18182 12.9091V24C3.18182 24.5523 3.62953 25 4.18182 25H21.8182C22.3705 25 22.8182 24.5523 22.8182 24Z" stroke="white" stroke-width="1.5" stroke-linejoin="round"/></svg>',
                    title: "P2P Маркет",
                    description: "Купить без посредников",
                    link: "topup_p2p_market",
                    background: "#8774E1",
                },
                {
                    svg: '<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 26 26" fill="none"><path d="M23.5 25H25M19 25H16V20.5M20.5 20.5H25V16H23.5M16 16H19M1 20.5C1 19.102 1 18.403 1.228 17.851C1.53247 17.1163 2.11625 16.5325 2.851 16.228C3.403 16 4.102 16 5.5 16C6.898 16 7.597 16 8.149 16.228C8.884 16.5325 9.4675 17.116 9.772 17.851C10 18.403 10 19.102 10 20.5C10 21.898 10 22.597 9.772 23.1475C9.6214 23.5116 9.40056 23.8425 9.12208 24.1212C8.84361 24.3999 8.51295 24.6211 8.149 24.772C7.597 25 6.898 25 5.5 25C4.102 25 3.403 25 2.851 24.772C2.11625 24.4675 1.53247 23.8838 1.228 23.149C1 22.597 1 21.898 1 20.5ZM16 5.5C16 4.102 16 3.403 16.228 2.851C16.5325 2.11625 17.1163 1.53247 17.851 1.228C18.403 1 19.102 1 20.5 1C21.898 1 22.597 1 23.149 1.228C23.884 1.5325 24.4675 2.116 24.772 2.851C25 3.403 25 4.102 25 5.5C25 6.898 25 7.597 24.772 8.1475C24.6214 8.51159 24.4006 8.84245 24.1221 9.12119C23.8436 9.39992 23.513 9.62107 23.149 9.772C22.597 10 21.898 10 20.5 10C19.102 10 18.403 10 17.851 9.772C17.1163 9.46753 16.5325 8.88375 16.228 8.149C16 7.597 16 6.898 16 5.5ZM1 5.5C1 4.102 1 3.403 1.228 2.851C1.53247 2.11625 2.11625 1.53247 2.851 1.228C3.403 1 4.102 1 5.5 1C6.898 1 7.597 1 8.149 1.228C8.884 1.5325 9.4675 2.116 9.772 2.851C10 3.403 10 4.102 10 5.5C10 6.898 10 7.597 9.772 8.1475C9.6214 8.51159 9.40056 8.84245 9.12208 9.12119C8.84361 9.39992 8.51295 9.62107 8.149 9.772C7.597 10 6.898 10 5.5 10C4.102 10 3.403 10 2.851 9.772C2.11625 9.46753 1.53247 8.88375 1.228 8.149C1 7.597 1 6.898 1 5.5Z" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/></svg>',
                    title: "Внешний кошелек",
                    description: "Перевести с другого кошелька",
                    link: "topupwallet",
                    background: "#8774E1",
                }
            ]
        }
    }
}
</script>

<template>
    <div class="topup">
        <way-payment-component v-for="payment in payments" :title="payment.title" :background="payment.background"
        :description="payment.description" :link="payment.link" :svg="payment.svg"/>
    </div>
</template>

<style scoped>

</style>